In [27]:
# Un « nettoyeur » rapide et rudimentaire pour certains fichiers de données. Trois ensembles de données seront nettoyés, avec un reformatage des cellules si nécessaire.

## First Dataset: BL-Flickr-Images-Book.cvs

In [2]:
import numpy as np
import pandas as pd

In [3]:
DF = pd.read_csv('Datasets/BL-Flickr-Images-Book.csv', skipinitialspace=True)

In [5]:
DF.head(5)

,Identifier,Edition Statement,Place of Publication,Date of Publication,Publisher,Title,Author,Contributors,Corporate Author,Corporate Contributors,Former owner,Engraver,Issuance type,Flickr URL,Shelfmarks
0,206,NaN,London,1879 [1878],S. Tinsley & Co.,Walter Forbes. [A novel.] By A. A,A. A.,"FORBES, Walter.",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 12641.b.30.
1,216,NaN,London; Virtue & Yorston,1868,Virtue & Co.,All for Greed. [A novel. The dedication signed...,"A., A. A.","BLAZE DE BURY, Marie Pauline Rose - Baroness",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 12626.cc.2.
2,218,NaN,London,1869,"Bradbury, Evans & Co.",Love the Avenger. By the author of “All for Gr...,"A., A. A.","BLAZE DE BURY, Marie Pauline Rose - Baroness",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 12625.dd.1.
3,472,NaN,London,1851,James Darling,"Welsh Sketches, chiefly ecclesiastical, to the...","A., E. S.","Appleyard, Ernest Silvanus.",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 10369.bbb.15.
4,480,"A new edition, revised, etc.",London,1857,Wertheim & Macintosh,"[The World in which I live, and my place in it...","A., E. S.","BROOME, John Henry.",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 9007.d.28.

In [6]:
TO_DROP = ['Edition Statement',
           'Corporate Author',
           'Corporate Contributors',
           'Former owner',
           'Engraver',
           'Contributors',
           'Issuance type',
           'Shelfmarks']

In [7]:
DF.drop(TO_DROP, axis=1, inplace=True)

In [8]:
DF.head()

,Identifier,Place of Publication,Date of Publication,Publisher,Title,Author,Flickr URL
0,206,London,1879 [1878],S. Tinsley & Co.,Walter Forbes. [A novel.] By A. A,A. A.,http://www.flickr.com/photos/britishlibrary/ta...
1,216,London; Virtue & Yorston,1868,Virtue & Co.,All for Greed. [A novel. The dedication signed...,"A., A. A.",http://www.flickr.com/photos/britishlibrary/ta...
2,218,London,1869,"Bradbury, Evans & Co.",Love the Avenger. By the author of “All for Gr...,"A., A. A.",http://www.flickr.com/photos/britishlibrary/ta...
3,472,London,1851,James Darling,"Welsh Sketches, chiefly ecclesiastical, to the...","A., E. S.",http://www.flickr.com/photos/britishlibrary/ta...
4,480,London,1857,Wertheim & Macintosh,"[The World in which I live, and my place in it...","A., E. S.",http://www.flickr.com/photos/britishlibrary/ta...

In [9]:
DF.describe()

         Identifier
count  8.287000e+03
mean   2.017344e+06
std    1.190379e+06
min    2.060000e+02
25%    9.157875e+05
50%    2.043707e+06
75%    3.047430e+06
max    4.160339e+06

In [10]:
DF.set_index('Identifier', inplace=True)

In [11]:
# Utiliser une expression régulière pour extraire une Date de Publication nettoyée.
EXTRACT = DF['Date of Publication'].str.extract(r'^(\d{4})', expand=False)

In [12]:
DF['Date of Publication'] = pd.to_numeric(EXTRACT)

In [14]:
# Utiliser NumPy pour nettoyer le lieu de publication; Place of Publication
PUB = DF['Place of Publication']
LONDON = PUB.str.contains('London')
OXFORD = PUB.str.contains('Oxford')

In [17]:
DF['Place of Publication'] = np.where(LONDON, 'London',
                                      np.where(OXFORD, 'Oxford',
                                               PUB.str.replace('-', ' '))
)

In [18]:
DF.to_csv('Output/first_save.csv', header='column_names')

In [19]:
first = pd.read_csv('Output/first_save.csv',skipinitialspace=True)

In [21]:
first.head()

,Identifier,Place of Publication,Date of Publication,Publisher,Title,Author,Flickr URL
0,206,London,1879.0,S. Tinsley & Co.,Walter Forbes. [A novel.] By A. A,A. A.,http://www.flickr.com/photos/britishlibrary/ta...
1,216,London,1868.0,Virtue & Co.,All for Greed. [A novel. The dedication signed...,"A., A. A.",http://www.flickr.com/photos/britishlibrary/ta...
2,218,London,1869.0,"Bradbury, Evans & Co.",Love the Avenger. By the author of “All for Gr...,"A., A. A.",http://www.flickr.com/photos/britishlibrary/ta...
3,472,London,1851.0,James Darling,"Welsh Sketches, chiefly ecclesiastical, to the...","A., E. S.",http://www.flickr.com/photos/britishlibrary/ta...
4,480,London,1857.0,Wertheim & Macintosh,"[The World in which I live, and my place in it...","A., E. S.",http://www.flickr.com/photos/britishlibrary/ta...

In [23]:
first.dtypes

Identifier                int64
Place of Publication     object
Date of Publication     float64
Publisher                object
Title                    object
Author                   object
Flickr URL               object
dtype: object

In [24]:
first.columns

Index(['Identifier', 'Place of Publication', 'Date of Publication',
       'Publisher', 'Title', 'Author', 'Flickr URL'],
      dtype='object')

In [26]:
first.describe()

         Identifier  Date of Publication
count  8.287000e+03          7316.000000
mean   2.017344e+06          1856.628759
std    1.190379e+06            42.483954
min    2.060000e+02          1510.000000
25%    9.157875e+05          1842.000000
50%    2.043707e+06          1867.000000
75%    3.047430e+06          1886.000000
max    4.160339e+06          1915.000000

## Second Dataset: university_towns.txt

In [28]:
UNIVERSITY_TOWNS = []
with open('Datasets/university_towns.txt') as towns:
    for line in towns:
        if '[edit]' in line:
            # Remember this `state` until the next is found
            state = line
        else:
            # Otherwise, we have a city; keep `state` as last-seen
            UNIVERSITY_TOWNS.append((state, line))

TOWNS_DF = pd.DataFrame(UNIVERSITY_TOWNS,
                        columns=['State', 'RegionName'])

In [29]:
TOWNS_DF.head()

             State                                         RegionName
0  Alabama[edit]\n                    Auburn (Auburn University)[1]\n
1  Alabama[edit]\n           Florence (University of North Alabama)\n
2  Alabama[edit]\n  Jacksonville (Jacksonville State University)[2]\n
3  Alabama[edit]\n       Livingston (University of West Alabama)[2]\n
4  Alabama[edit]\n         Montevallo (University of Montevallo)[2]\n

In [30]:
def get_citystate(item):
    """Help for cleaning up data cells."""
    if ' (' in item:
        return item[:item.find(' (')]
    elif '[' in item:
        return item[:item.find('[')]
    return item

In [32]:
# Appliquons notre fonction à chaque cellule de notre dataframe.
TOWNS_DF = TOWNS_DF.map(get_citystate)

In [33]:
TOWNS_DF.head()

     State    RegionName
0  Alabama        Auburn
1  Alabama      Florence
2  Alabama  Jacksonville
3  Alabama    Livingston
4  Alabama    Montevallo

In [36]:
TOWNS_DF.columns

Index(['State', 'RegionName'], dtype='object')

In [34]:
# sauvegardont le nouveau fichier
TOWNS_DF.to_csv('Output/second_save.csv', header='column_names')

## Third Dataset: olympics.csv

In [38]:
OLYMPICS_DF = pd.read_csv('Datasets/olympics.csv', header=1)

In [39]:
NEW_NAMES = {'Unnamed: 0': 'Country',
             '? Summer': 'Summer Olympics',
             '01 !': 'Gold',
             '02 !': 'Silver',
             '03 !': 'Bronze',
             '? Winter': 'Winter Olympics',
             '01 !.1': 'Gold.1',
             '02 !.1': 'Silver.1',
             '03 !.1': 'Bronze.1',
             '? Games': '# Games',
             '01 !.2': 'Gold.2',
             '02 !.2': 'Silver.2',
             '03 !.2': 'Bronze.2'}

In [41]:
# Renommer quelque colonnes
OLYMPICS_DF.rename(columns=NEW_NAMES, inplace=True)

In [42]:
OLYMPICS_DF.head()

,Country,Summer Olympics,Gold,Silver,Bronze,Total,Winter Olympics,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total
0,Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
1,Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
2,Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
3,Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
4,Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12

In [43]:
OLYMPICS_DF.dtypes

Country            object
Summer Olympics     int64
Gold                int64
Silver              int64
Bronze              int64
Total               int64
Winter Olympics     int64
Gold.1              int64
Silver.1            int64
Bronze.1            int64
Total.1             int64
# Games             int64
Gold.2              int64
Silver.2            int64
Bronze.2            int64
Combined total      int64
dtype: object

In [44]:
OLYMPICS_DF.columns

Index(['Country', 'Summer Olympics', 'Gold', 'Silver', 'Bronze', 'Total',
       'Winter Olympics', 'Gold.1', 'Silver.1', 'Bronze.1', 'Total.1',
       '# Games', 'Gold.2', 'Silver.2', 'Bronze.2', 'Combined total'],
      dtype='object')

In [50]:
OLYMPICS_DF.hist

<bound method hist_frame of                                           Country  Summer Olympics  Gold  \
0                               Afghanistan (AFG)               13     0
1                                   Algeria (ALG)               12     5
2                                 Argentina (ARG)               23    18
3                                   Armenia (ARM)                5     1
4                         Australasia (ANZ) [ANZ]                2     3
..                                            ...              ...   ...
142  Independent Olympic Participants (IOP) [IOP]                1     0
143                            Zambia (ZAM) [ZAM]               12     0
144                          Zimbabwe (ZIM) [ZIM]               12     3
145                        Mixed team (ZZX) [ZZX]                3     8
146                                        Totals               27  4809

     Silver  Bronze  Total  Winter Olympics  Gold.1  Silver.1  Bronze.1  \
0         0       2      2                0       0         0         0
1         2       8     15                3       0         0         0
2        24      28     70               18       0         0         0
3         2       9     12                6       0         0         0
4         4       5     12                0       0         0         0
..      ...     ...    ...              ...     ...       ...       ...
142       1       2      3                0       0         0         0
143       1       1      2                0       0         0         0
144       4       1      8                1       0         0         0
145       5       4     17                0       0         0         0
146    4775    5130  14714               22     959       958       948

     Total.1  # Games  Gold.2  Silver.2  Bronze.2  Combined total
0          0       13       0         0         2               2
1          0       15       5         2         8              15
2          0       41      18        24        28              70
3          0       11       1         2         9              12
4          0        2       3         4         5              12
..       ...      ...     ...       ...       ...             ...
142        0        1       0         1         2               3
143        0       12       0         1         1               2
144        0       13       3         4         1               8
145        0        3       8         5         4              17
146     2865       49    5768      5733      6078           17579

[147 rows x 16 columns]>

In [51]:
OLYMPICS_DF.to_csv('Output/save_three.csv', header='column_names')